Revit 2026 API

# TableSectionDataResetCellOverride(Int32) Method

---

Resets the override of the column.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ResetCellOverride(
	int nCol
)
```
```vb
Public Sub ResetCellOverride (
	nCol As Integer
)
```
```cpp
public:
void ResetCellOverride(
	int nCol
)
```
```fsharp
member ResetCellOverride :
        nCol : int -> unit
```

#### Parameters

nCol Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | The given column number nCol is invalid. |

#### Reference

TableSectionData Class

ResetCellOverride Overload

Autodesk.Revit.DB Namespace